app/controllers/properties_controller.rb

  def index
    @properties = Property.all
    filtered_properties = []

    if params[:district].present?
      filtered_properties << Property.search_by_district(params[:district])
    end

    if params[:property_type].present?
      filtered_properties << Property.search_by_property_type(params[:property_type])
    end

    if params[:city].present?
      filtered_properties << Property.search_by_city(params[:city])
    end

    if params[:min_size].present? || params[:max_size].present?
      filtered_properties << Property.search_by_size_range(params[:min_size], params[:max_size])
    end

    if params[:min_rent].present? || params[:max_rent].present?
      filtered_properties << Property.search_by_rent_range(params[:min_rent], params[:max_rent])
---
SELECT "properties".* FROM "properties" WHERE (district LIKE '%lahore%' COLLATE NOCASE)
INSERT INTO "properties" ("Title", "District", "size", "rent", "property_type", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["Title", ""], ["District", ""], ["size", nil], ["rent", nil], ["property_type", nil], ["city", nil], ["created_at", "2023-09-08 12:11:50.749253"], ["updated_at", "2023-09-08 12:11:50.749253"]]

  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("Title", "District", "size", "rent", "property_type", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)